# 캐멀케이스(대문자 시작) -> 클래스
# 스네이크케이스(소문자 시작)
# 주석 : 프로그램에 영향을 주지 않는 코드(#으로 시작)

# 뒤에 괄호가 있다 -> 함수
# 뒤에 괄호가 없다 -> 변수
# print() -> 함수, 스네이크
# class Animal -> 클래스, 캐멀
# BeautifuSoup() -> 클래스 생성자, 캐멀
# math.pi -> 변수, 스네이크

# 키워드 : 의미가 부여된 특별한 단어
# 식별자 : 프로그래밍 언어에서 이름 붙일 때 사용하는 단어
# print() : 출력
# 이스케이프 문자 (\n, \t)

# 문자열 더하기연산자
# "문자열" + "문자열"
# 문자열 반복연산자
# 안녕하세요 *3
# 문자열 선택
# print("안녕하세요"[1]) -> 녕
# 문자열 범위선택
# print("안녕하세요"[1:4]) -> 녕하세요
# print(len("안녕하세요")) -> 5

# // : 몫 연산자
# / : 나누기 연산자
# % : 나머지 연산자
# ** : 제곱 연산자

# 변수는 값을 저장할 때 사용하는 식별자
# pi = 3.14159865
# 우변의 값을 좌변에 넣는다.

# 복합대입연산자(+=,-=,*=,/=,%=,**=)

# 입력함수
# input() : 사용자로부터 데이터를 입력받기 위한 함수
# int(input()) : 정수 형변환 입력

# 대소문자 변환
# upper() : 대문자
# lower() : 소문자

# 공백 제거
# strip() : 양쪽 제거
# lstrip() : 왼쪽 제거
# rstrip() : 오른쪽 제거

# 문자열 구성 파악 : isOO (bool형)
# isalnum() : 문자열이 알파벳 또는 수자로만 구성되어 있는지 확인
# isdigit() : 문자열이 숫자로만 구성되어 있는지 확인
# islower() : 문자열이 소문자로만 구성되어 있는지 확인
# isupper() : 문자열이 대문자로만 구성되어 있는지 확인

# 문자열 찾기
# find() : 찾는 문자열의 왼쪽부터 처음 등장하는 위치를 찾음
# rfind() : 찾는 문자열의 오른쪽부터 처음 등장하는 위치를 찾음

# 문자열과 in 연산자(bool형)
# 문자열 내부에 어떤 문자열이 있는지 확인하는 in 연산자 (찾을 문자열 in 대상 문자열)

# 문자열 자르기 : .split() -> 실행결과가 리스트로 나옴

# 비교연산자 (==, !=, <, >, <=, >=)
# 논리연산자 (not, and, or)